#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`

#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>
  
```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # mongodbatlas_cluster.fiap_burger will be created
  + resource "mongodbatlas_cluster" "fiap_burger" {
      + accept_data_risks_and_force_replica_set_reconfig = (known after apply)
      + auto_scaling_compute_enabled                     = (known after apply)
      + auto_scaling_compute_scale_down_enabled          = (known after apply)
      + auto_scaling_disk_gb_enabled                     = (known after apply)
      + backing_provider_name                            = "AWS"
      + backup_enabled                                   = (known after apply)
      + cloud_backup                                     = (known after apply)
      + cluster_id                                       = (known after apply)
      + cluster_type                                     = "REPLICASET"
      + connection_strings                               = (known after apply)
      + container_id                                     = (known after apply)
      + disk_size_gb                                     = 0.5
      + encryption_at_rest_provider                      = (known after apply)
      + id                                               = (known after apply)
      + mongo_db_major_version                           = (known after apply)
      + mongo_db_version                                 = (known after apply)
      + mongo_uri                                        = (known after apply)
      + mongo_uri_updated                                = (known after apply)
      + mongo_uri_with_options                           = (known after apply)
      + name                                             = "FiapBurger"
      + num_shards                                       = (known after apply)
      + paused                                           = (known after apply)
      + pit_enabled                                      = (known after apply)
      + project_id                                       = (known after apply)
      + provider_auto_scaling_compute_max_instance_size  = (known after apply)
      + provider_auto_scaling_compute_min_instance_size  = (known after apply)
      + provider_disk_iops                               = (known after apply)
      + provider_disk_type_name                          = (known after apply)
      + provider_encrypt_ebs_volume                      = (known after apply)
      + provider_encrypt_ebs_volume_flag                 = (known after apply)
      + provider_instance_size_name                      = "M0"
      + provider_name                                    = "TENANT"
      + provider_region_name                             = "US_EAST_1"
      + provider_volume_type                             = (known after apply)
      + redact_client_log_data                           = (known after apply)
      + replication_factor                               = (known after apply)
      + snapshot_backup_policy                           = (known after apply)
      + srv_address                                      = (known after apply)
      + state_name                                       = (known after apply)
      + termination_protection_enabled                   = (known after apply)
      + version_release_system                           = (known after apply)

      + advanced_configuration (known after apply)

      + bi_connector_config (known after apply)

      + replication_specs (known after apply)
    }

  # mongodbatlas_database_user.db_user_gm50x will be created
  + resource "mongodbatlas_database_user" "db_user_gm50x" {
      + auth_database_name = "admin"
      + aws_iam_type       = "NONE"
      + id                 = (known after apply)
      + ldap_auth_type     = "NONE"
      + oidc_auth_type     = "NONE"
      + password           = (sensitive value)
      + project_id         = (known after apply)
      + username           = "gm50x-admin"
      + x509_type          = "NONE"

      + roles {
          + database_name = "admin"
          + role_name     = "readWriteAnyDatabase"
        }
    }

  # mongodbatlas_database_user.db_user_orders will be created
  + resource "mongodbatlas_database_user" "db_user_orders" {
      + auth_database_name = "admin"
      + aws_iam_type       = "NONE"
      + id                 = (known after apply)
      + ldap_auth_type     = "NONE"
      + oidc_auth_type     = "NONE"
      + password           = (sensitive value)
      + project_id         = (known after apply)
      + username           = "orders-app"
      + x509_type          = "NONE"

      + roles {
          + database_name = "Orders"
          + role_name     = "readWrite"
        }
    }

  # mongodbatlas_database_user.db_user_payments will be created
  + resource "mongodbatlas_database_user" "db_user_payments" {
      + auth_database_name = "admin"
      + aws_iam_type       = "NONE"
      + id                 = (known after apply)
      + ldap_auth_type     = "NONE"
      + oidc_auth_type     = "NONE"
      + password           = (sensitive value)
      + project_id         = (known after apply)
      + username           = "payments-app"
      + x509_type          = "NONE"

      + roles {
          + database_name = "Payments"
          + role_name     = "readWrite"
        }
    }

  # mongodbatlas_project.fiap_burger will be created
  + resource "mongodbatlas_project" "fiap_burger" {
      + cluster_count                                    = (known after apply)
      + created                                          = (known after apply)
      + id                                               = (known after apply)
      + ip_addresses                                     = (known after apply)
      + is_collect_database_specifics_statistics_enabled = (known after apply)
      + is_data_explorer_enabled                         = (known after apply)
      + is_extended_storage_sizes_enabled                = (known after apply)
      + is_performance_advisor_enabled                   = (known after apply)
      + is_realtime_performance_panel_enabled            = (known after apply)
      + is_schema_advisor_enabled                        = (known after apply)
      + is_slow_operation_thresholding_enabled           = (known after apply)
      + name                                             = "FiapBurger"
      + org_id                                           = "5b68bd980bd66b356a37284b"
      + region_usage_restrictions                        = (known after apply)
      + with_default_alerts_settings                     = true
    }

  # mongodbatlas_project_ip_access_list.allow_all_access will be created
  + resource "mongodbatlas_project_ip_access_list" "allow_all_access" {
      + aws_security_group = (known after apply)
      + cidr_block         = "0.0.0.0/0"
      + comment            = "Allow All Access"
      + id                 = (known after apply)
      + ip_address         = (known after apply)
      + project_id         = (known after apply)
    }

  # random_password.db_pass_gm50x will be created
  + resource "random_password" "db_pass_gm50x" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "_%@"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # random_password.db_pass_orders will be created
  + resource "random_password" "db_pass_orders" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "_%@"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # random_password.db_pass_payments will be created
  + resource "random_password" "db_pass_payments" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "_%@"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + mongodb_connection_string = (sensitive value)
  + mongodb_password_gm50x    = (sensitive value)
  + mongodb_password_orders   = (sensitive value)
  + mongodb_password_payments = (sensitive value)
  + mongodb_username_gm50x    = (sensitive value)
  + mongodb_username_orders   = (sensitive value)
  + mongodb_username_payments = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
  
</details>

*Pusher: @gm50x*
*Action: `pull_request`*
*Workflow: `Terraform IAC - MongoDB Atlas`*